In [5]:
import pandas as pd
import numpy as np
import seaborn as sns

In [6]:
df = pd.read_csv('Dataset_RAIS_sampleado.csv')

In [7]:
df.shape

(1067949, 17)

In [8]:
df.columns

Index(['ano', 'sigla_uf', 'id_municipio', 'cbo_2002', 'cnae_2', 'sexo',
       'idade', 'raca_cor', 'grau_instrucao_apos_2005', 'tempo_emprego',
       'mes_admissao', 'mes_desligamento', 'vinculo_ativo_3112',
       'valor_remuneracao_media', 'valor_salario_contratual',
       'tamanho_estabelecimento', 'natureza_juridica'],
      dtype='object')

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1067949 entries, 0 to 1067948
Data columns (total 17 columns):
 #   Column                    Non-Null Count    Dtype
---  ------                    --------------    -----
 0   ano                       1067949 non-null  int64
 1   sigla_uf                  1067949 non-null  object
 2   id_municipio              1067896 non-null  float64
 3   cbo_2002                  1067949 non-null  int64
 4   cnae_2                    1067949 non-null  int64
 5   sexo                      1067949 non-null  int64
 6   idade                     1067949 non-null  int64
 7   raca_cor                  1067949 non-null  int64
 8   grau_instrucao_apos_2005  1067949 non-null  int64
 9   tempo_emprego             1067949 non-null  float64
 10  mes_admissao              310176 non-null   float64
 11  mes_desligamento          272465 non-null   float64
 12  vinculo_ativo_3112        1067949 non-null  int64
 13  valor_remuneracao_media   1067949 non-null  float64
 14  valor_salario_contratual  0 non-null        float64
 15  tamanho_estabelecimento   1067949 non-null  int64
 16  natureza_juridica         1067353 non-null  float64
dtypes: float64(7), int64(9), object(1)
memory usage: 138.5+ MB

In [10]:
df.head()

,ano,sigla_uf,id_municipio,cbo_2002,cnae_2,sexo,idade,raca_cor,grau_instrucao_apos_2005,tempo_emprego,mes_admissao,mes_desligamento,vinculo_ativo_3112,valor_remuneracao_media,valor_salario_contratual,tamanho_estabelecimento,natureza_juridica
0,2021,CE,2304350.0,317205,84116,1,43,9,9,180.9,NaN,8.0,0,1152.38,NaN,9,1031.0
1,2021,CE,2304301.0,317205,84116,1,36,9,9,142.9,NaN,NaN,1,2452.72,NaN,9,1031.0
2,2022,RJ,3304524.0,212315,9106,1,41,2,9,1.2,NaN,1.0,0,691.06,NaN,10,2046.0
3,2022,RJ,3304524.0,317210,61906,2,26,4,7,9.4,1.0,10.0,0,16909.79,NaN,1,2062.0
4,2022,RJ,3304524.0,212420,9106,1,33,2,7,7.8,5.0,NaN,1,14059.07,NaN,10,2046.0

In [11]:
df.tail()

,ano,sigla_uf,id_municipio,cbo_2002,cnae_2,sexo,idade,raca_cor,grau_instrucao_apos_2005,tempo_emprego,mes_admissao,mes_desligamento,vinculo_ativo_3112,valor_remuneracao_media,valor_salario_contratual,tamanho_estabelecimento,natureza_juridica
1067944,2019,PE,2607901.0,212405,49221,1,50,2,7,296.9,NaN,NaN,1,0.00,NaN,8,2054.0
1067945,2019,PE,2607901.0,212405,49302,1,38,2,9,66.9,NaN,10.0,0,3310.54,NaN,1,2054.0
1067946,2019,PE,2608800.0,317110,61906,1,34,8,8,85.9,NaN,NaN,1,0.00,NaN,6,2062.0
1067947,2019,PE,2607208.0,317205,68102,2,48,2,9,323.4,NaN,NaN,1,0.00,NaN,2,2054.0
1067948,2019,PE,2604106.0,212405,84116,1,31,9,9,54.9,NaN,NaN,1,1986.99,NaN,10,1031.0

- Cada linha da RAIS representa o vínculo empregatício. Ou seja, um mesmo cpf pode aparecer mais de uma vez com valores diferentes(outro emprego)

In [12]:
df.isnull().sum()

ano                               0
sigla_uf                          0
id_municipio                     53
cbo_2002                          0
cnae_2                            0
sexo                              0
idade                             0
raca_cor                          0
grau_instrucao_apos_2005          0
tempo_emprego                     0
mes_admissao                 757773
mes_desligamento             795484
vinculo_ativo_3112                0
valor_remuneracao_media           0
valor_salario_contratual    1067949
tamanho_estabelecimento           0
natureza_juridica               596
dtype: int64

In [13]:
df['sexo'].unique()

array([1, 2])

In [14]:
df['grau_instrucao_apos_2005'].value_counts()

grau_instrucao_apos_2005
9     603594
7     244664
8     183777
10     13232
6      11348
5       5350
11      3288
4       1389
1        561
3        435
2        311
Name: count, dtype: int64